ClassicDIY/ClassicMQTT/code/ESP32/ClassicMQTT/src/main.cpp
#include <Arduino.h>
#include <Preferences.h>
#include <WiFi.h>
#include <EEPROM.h>
#include <IotWebConf.h>
#include <IotWebConfUsing.h>
#include <ArduinoJson.h>
#include "AsyncMqttClient.h"
#include <esp32ModbusTCP.h>
#include "Log.h"
#include "ChargeControllerInfo.h"

// Include Update server
#ifdef ESP8266
# include <ESP8266HTTPUpdateServer.h>
#elif defined(ESP32)
# include <IotWebConfESP32HTTPUpdateServer.h>
#endif

using namespace std;

#define MAX_PUBLISH_RATE 30000              //30 seconds
#define MIN_PUBLISH_RATE 5000               //5 seconds 
#define WAKE_PUBLISH_RATE 5000              //5 seconds
#define SNOOZE_PUBLISH_RATE 300000          //300 seconds = 5 minutes 
#define MIN_MODBUS_POLL_INTERVAL 1000           //1 second - min time between modbus requests.
#define MAX_MODBUS_READ_ATTEMPTS 3          //maximum number of tries per publish cycle.
#define WAKE_COUNT 60

#define CONFIG_VERSION "V1.3.4" // major.minor.build (major or minor will invalidate the configuration)
#define NUMBER_CONFIG_LEN 6
#define WATCHDOG_TIMER 600000               //time in ms to trigger the watchdog
#define MODBUS_READ_TIMEOUT 300000          //5 minutes in ms. Clear the modbus read

AsyncMqttClient _mqttClient;
TimerHandle_t mqttReconnectTimer;
DNSServer _dnsServer;
WebServer _webServer(80);
#ifdef ESP8266
ESP8266HTTPUpdateServer httpUpdater;
#elif defined(ESP32)
HTTPUpdateServer httpUpdater;
#endif
IotWebConf _iotWebConf(TAG, &_dnsServer, &_webServer, TAG, CONFIG_VERSION);
hw_timer_t *_watchdogTimer = NULL;
hw_timer_t *_modbusReadTimer = NULL;
int modbusRequestFailureCount = 0;
boolean doPublish = false;


int _currentRegister = 0;
uint16_t _currentRequestId = 0;

void modbus4100(uint8_t *data);
void modbus4360(uint8_t *data);
void modbus4163(uint8_t *data);
void modbus4243(uint8_t *data);
void modbus16386(uint8_t *data);

#define numBanks 5
static ModbusRegisterBank _registers[numBanks] = {
	{false, 4100, 44, modbus4100},    //0
	{false, 4360, 22, modbus4360},    //1
	{false, 4163, 2, modbus4163},     //2
	{false, 4243, 32, modbus4243},    //3
	{false, 16386, 4, modbus16386}};  //4





char _classicIP[IOTWEBCONF_WORD_LEN];
char _classicPort[NUMBER_CONFIG_LEN];
char _classicName[IOTWEBCONF_WORD_LEN];
char _mqttServer[IOTWEBCONF_WORD_LEN];
char _mqttPort[NUMBER_CONFIG_LEN];
char _mqttUserName[IOTWEBCONF_WORD_LEN];
char _mqttUserPassword[IOTWEBCONF_WORD_LEN];
char _mqttRootTopic[64];
char _wakePublishRateStr[NUMBER_CONFIG_LEN];
char _willTopic[64];
char _rootTopicPrefix[64];
iotwebconf::ParameterGroup Classic_group = iotwebconf::ParameterGroup("ClassGroup", "Classic");
iotwebconf::TextParameter classicIPParam = iotwebconf::TextParameter("Classic IP", "classicIP", _classicIP, IOTWEBCONF_WORD_LEN);
iotwebconf::NumberParameter classicPortParam = iotwebconf::NumberParameter("Classic port", "classicPort", _classicPort, NUMBER_CONFIG_LEN, "text", NULL, "502");
iotwebconf::TextParameter classicNameParam = iotwebconf::TextParameter("Classic Name", "classicName", _classicName, IOTWEBCONF_WORD_LEN);

iotwebconf::ParameterGroup MQTT_group = iotwebconf::ParameterGroup("MQTT", "MQTT");
iotwebconf::TextParameter mqttServerParam = iotwebconf::TextParameter("MQTT server", "mqttServer", _mqttServer, IOTWEBCONF_WORD_LEN);
iotwebconf::NumberParameter mqttPortParam = iotwebconf::NumberParameter("MQTT port", "mqttSPort", _mqttPort, NUMBER_CONFIG_LEN, "text", NULL, "1883");
iotwebconf::TextParameter mqttUserNameParam = iotwebconf::TextParameter("MQTT user", "mqttUser", _mqttUserName, IOTWEBCONF_WORD_LEN);
iotwebconf::PasswordParameter mqttUserPasswordParam = iotwebconf::PasswordParameter("MQTT password", "mqttPass", _mqttUserPassword, IOTWEBCONF_WORD_LEN, "password");
iotwebconf::TextParameter mqttRootTopicParam = iotwebconf::TextParameter("MQTT Root Topic", "mqttRootTopic", _mqttRootTopic, IOTWEBCONF_WORD_LEN);
iotwebconf::NumberParameter wakePublishRateParam = iotwebconf::NumberParameter("Publish Rate (S)", "wakePublishRate", _wakePublishRateStr, NUMBER_CONFIG_LEN, "5", "between 5 and 30", "step='1'");


unsigned long _nextPublishTime = 0;
unsigned long _nextModbusPollTimeStamp = 0;
unsigned long _currentPublishRate = WAKE_PUBLISH_RATE; // rate currently being used
unsigned long _wakePublishRate = WAKE_PUBLISH_RATE; // wake publish rate set by config or mqtt command
boolean _stayAwake = false;
int _publishAttemptCount = 0;

bool _clientsConfigured = false;
bool _mqttReadingsAvailable = false;
bool _boilerPlateInfoPublished = false;
uint8_t _boilerPlateReadBitField = 0;
ChargeControllerInfo _chargeControllerInfo;
esp32ModbusTCP *_pClassic;


void IRAM_ATTR clearModbusRead()
{
	_currentRequestId = 0; //clear a hanging read that appears to never come back.
	loge("Long MODBUS read, requestId cleared");
	//ets_printf("Long MODBUS read, requestId cleared\n");
}

void IRAM_ATTR resetModule()
{
	//ets_printf("watchdog timer expired - rebooting\n");
	esp_restart();
}

void init_modbusReadTimer()
{
	if (_modbusReadTimer == NULL)
	{
		_modbusReadTimer = timerBegin(0, 80, true);					   //timer 0, div 80
		timerAttachInterrupt(_modbusReadTimer, &clearModbusRead, true);	  //attach callback
		timerAlarmWrite(_modbusReadTimer, MODBUS_READ_TIMEOUT * 1000, false); //set time in us
		timerAlarmEnable(_modbusReadTimer);							   //enable interrupt
	}
}


void init_watchdog()
{
	if (_watchdogTimer == NULL)
	{
		_watchdogTimer = timerBegin(0, 80, true);					   //timer 0, div 80
		timerAttachInterrupt(_watchdogTimer, &resetModule, true);	  //attach callback
		timerAlarmWrite(_watchdogTimer, WATCHDOG_TIMER * 1000, false); //set time in us
		timerAlarmEnable(_watchdogTimer);							   //enable interrupt
	}
}

void resetStart_modbusReadTimer()
{
	if (_modbusReadTimer != NULL)
	{
		timerWrite(_modbusReadTimer, 0); // reset the timer to start counting up again
		if (!timerStarted(_modbusReadTimer)){
			timerStart(_modbusReadTimer);
		}
	}
}
void stop_modbusReadTimer() 
{
	if (_modbusReadTimer != NULL)
	{
		timerStop(_modbusReadTimer); // reset the timer to start counting up again
	}
}


void feed_watchdog()
{
	if (_watchdogTimer != NULL)
	{
		timerWrite(_watchdogTimer, 0); // feed the watchdog
	}
}

void publish(const char *subtopic, const char *value, boolean retained = false)
{
	if (_mqttClient.connected())
	{
		char buf[64];
		sprintf(buf, "%s/stat/%s", _rootTopicPrefix, subtopic);
		_mqttClient.publish(buf, 0, retained, value);
	}
}

// note, add 0.01 as a work around for Android JSON deserialization bug with float
void publishReadings()
{
	StaticJsonDocument<1024> root;
	if ((_boilerPlateReadBitField & 0x0f) == 0x0f && _boilerPlateInfoPublished == false)
	{
		_boilerPlateInfoPublished = true;
		root["unitID"] = _chargeControllerInfo.unitID;
		root["deviceName"] = _classicName;
		root["hasWhizbang"] = _chargeControllerInfo.hasWhizbang;
		root["deviceType"] = "Classic";
		root["model"] = _chargeControllerInfo.model;
		root["lastVOC"] = _chargeControllerInfo.lastVOC + 0.01;
		root["appVersion"] = _chargeControllerInfo.appVersion;
		root["netVersion"] = _chargeControllerInfo.netVersion;
		root["buildDate"] = _chargeControllerInfo.buildDate;
		root["nominalBatteryVoltage"] = _chargeControllerInfo.nominalBatteryVoltage;
		root["mpptMode"] = _chargeControllerInfo.mpptMode;
		root["endingAmps"] = _chargeControllerInfo.endingAmps + 0.01;
		root["macAddress"] = _chargeControllerInfo.macAddress;
		String s;
		serializeJson(root, s);
		publish("info", s.c_str());
	}
	root.clear();
	root["BatTemperature"] = _chargeControllerInfo.BatTemperature + 0.01;
	root["NetAmpHours"] = _chargeControllerInfo.NetAmpHours;
	root["ChargeState"] = _chargeControllerInfo.ChargeState;
	root["InfoFlagsBits"] = _chargeControllerInfo.InfoFlagsBits;
	root["ReasonForResting"] = _chargeControllerInfo.ReasonForResting;
	root["NegativeAmpHours"] = _chargeControllerInfo.NegativeAmpHours;
	root["BatVoltage"] = _chargeControllerInfo.BatVoltage + 0.01;
	root["PVVoltage"] = _chargeControllerInfo.PVVoltage + 0.01;
	root["VbattRegSetPTmpComp"] = _chargeControllerInfo.VbattRegSetPTmpComp;
	root["TotalAmpHours"] = _chargeControllerInfo.TotalAmpHours;
	root["WhizbangBatCurrent"] = _chargeControllerInfo.WhizbangBatCurrent + 0.01;
	root["BatCurrent"] = _chargeControllerInfo.BatCurrent + 0.01;
	root["PVCurrent"] = _chargeControllerInfo.PVCurrent + 0.01;
	root["ConnectionState"] = 0;
	root["EnergyToday"] = _chargeControllerInfo.EnergyToday + 0.01;
	root["EqualizeTime"] = _chargeControllerInfo.EqualizeTime;
	root["SOC"] = _chargeControllerInfo.SOC;
	root["Aux1"] = _chargeControllerInfo.Aux1;
	root["Aux2"] = _chargeControllerInfo.Aux2;
	root["Power"] = _chargeControllerInfo.Power + 0.01;
	root["FETTemperature"] = _chargeControllerInfo.FETTemperature + 0.01;
	root["PositiveAmpHours"] = _chargeControllerInfo.PositiveAmpHours;
	root["TotalEnergy"] = _chargeControllerInfo.TotalEnergy + 0.01;
	root["FloatTimeTodaySeconds"] = _chargeControllerInfo.FloatTimeTodaySeconds;
	root["RemainingAmpHours"] = _chargeControllerInfo.RemainingAmpHours;
	root["AbsorbTime"] = _chargeControllerInfo.AbsorbTime;
	root["ShuntTemperature"] = _chargeControllerInfo.ShuntTemperature + 0.01;
	root["PCBTemperature"] = _chargeControllerInfo.PCBTemperature + 0.01;
	String s;
	serializeJson(root, s);
	publish("readings", s.c_str());
}

uint16_t Getuint16Value(int index, uint8_t *data)
{
	index *= 2;
	return (data[index] << 8 | data[index + 1]);
}

