ClassicDIY/ClassicMQTT/code/ESP32/ClassicMQTT/src/main.cpp
			IPAddress ip;
			int port = atoi(_mqttPort);
			if (ip.fromString(_mqttServer))
			{
				_mqttClient.setServer(ip, port);
			}
			else
			{
				_mqttClient.setServer(_mqttServer, port);
			}
			_mqttClient.setCredentials(_mqttUserName, _mqttUserPassword);
			if (ip.fromString(_classicIP))
			{
				int port = atoi(_classicPort);
				_pClassic = new esp32ModbusTCP(10, ip, port);
				_pClassic->onData(modbusCallback);
				_pClassic->onError(modbusErrorCallback);
			}
		}
	}

	// IotWebConfParameter* p = _iotWebConf.getApPasswordParameter();
	// logi("AP Password: %s", p->valueBuffer);
	// Set up required URL handlers on the web server.
	_webServer.on("/", handleRoot);
	_webServer.on("/config", [] { _iotWebConf.handleConfig(); });
	_webServer.onNotFound([]() { _iotWebConf.handleNotFound(); });
	_nextPublishTime = millis() + WAKE_PUBLISH_RATE;
	init_watchdog();
	init_modbusReadTimer(); //set a time that will reset any hanging read
	logd("Done setup");
}

void loop()
{
	feed_watchdog();

	_iotWebConf.doLoop();
	if (_clientsConfigured && WiFi.isConnected())
	{
        //Is it publish time now?
		if (millis() > _nextPublishTime)
		{
			logd("Publish time");
			//if not yet snoozing, then up the publish count.
			if (_currentPublishRate != SNOOZE_PUBLISH_RATE) {
				_publishAttemptCount++;
			}
			doPublish = true;
			_nextPublishTime = _nextPublishTime + _currentPublishRate;
			_registers[0].received = false;
			_registers[1].received = false;
			//_currentRequestId = 0;
			modbusRequestFailureCount = 0;
		}

		if (doPublish){
			//Is it time to read from the Modbus again?
			int status = readModbus(); //0=failed, 1=request success, 2=request not needed; 3 = waiting
			
			if (status != 3 && status != 0) {
				logd("MODBUS Read Request status = %d", status);
			}

			if ( status == 0) {
				modbusRequestFailureCount++; //if failed up count
				loge("modbusRequestFailureCount %d", modbusRequestFailureCount);
			}

			//If failed to get readings from the modbus too many times, skip until next publish time
			if (modbusRequestFailureCount >= MAX_MODBUS_READ_ATTEMPTS){
				//skip this whole request
				doPublish = false;
				_nextPublishTime = millis() + (2 * _currentPublishRate); //halve the rate when getting errors.
				loge("MODBUS failures causing publish skip");
			
			} else if (_registers[0].received && _registers[1].received ) {
				//are we connected?
				if (_mqttClient.connected())
				{
					publishReadings();
				} else {
					loge("Mqtt is not connected");
				}

                //Done trying to publishing
				doPublish = false;
			}

			if (!_stayAwake && _publishAttemptCount >= WAKE_COUNT && _currentPublishRate != SNOOZE_PUBLISH_RATE)
			{
				_publishAttemptCount = 0;
				_currentPublishRate = SNOOZE_PUBLISH_RATE;
				logd("Snoozing! New rate %d", _currentPublishRate);
			}
		}
	}
	else
	{
		if (Serial.peek() == '{')
		{
			String s = Serial.readStringUntil('}');
			s += "}";
			StaticJsonDocument<128> doc;
			DeserializationError err = deserializeJson(doc, s);
			if (err)
			{
				loge("deserializeJson() failed: %s", err.c_str());
			}
			else
			{
				if (doc.containsKey("ssid") && doc.containsKey("password"))
				{
					iotwebconf::Parameter *p = _iotWebConf.getWifiSsidParameter();
					strcpy(p->valueBuffer, doc["ssid"]);
					logd("Setting ssid: %s", p->valueBuffer);
					p = _iotWebConf.getWifiPasswordParameter();
					strcpy(p->valueBuffer, doc["password"]);
					logd("Setting password: %s", p->valueBuffer);
					p = _iotWebConf.getApPasswordParameter();
					strcpy(p->valueBuffer, TAG); // reset to default AP password
					_iotWebConf.saveConfig();
					resetModule();
				}
				else
				{
					logw("Received invalid json: %s", s.c_str());
				}
			}
		}
		else
		{
			Serial.read(); // discard data
		}
	}
}
